###################################################################

# Created by write_sdc on Fri May 29 06:03:46 2026

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_wire_load_mode top
set_ideal_network [get_ports rst_n]
create_clock [get_ports clk]  -period 4000  -waveform {0 2000}
set_input_delay -clock clk  800  [get_ports rst_n]
set_input_delay -clock clk  800  [get_ports imem_valid]
set_input_delay -clock clk  800  [get_ports {imem_data[31]}]
set_input_delay -clock clk  800  [get_ports {imem_data[30]}]
set_input_delay -clock clk  800  [get_ports {imem_data[29]}]
set_input_delay -clock clk  800  [get_ports {imem_data[28]}]
set_input_delay -clock clk  800  [get_ports {imem_data[27]}]
set_input_delay -clock clk  800  [get_ports {imem_data[26]}]
set_input_delay -clock clk  800  [get_ports {imem_data[25]}]
set_input_delay -clock clk  800  [get_ports {imem_data[24]}]
set_input_delay -clock clk  800  [get_ports {imem_data[23]}]
set_input_delay -clock clk  800  [get_ports {imem_data[22]}]
set_input_delay -clock clk  800  [get_ports {imem_data[21]}]
set_input_delay -clock clk  800  [get_ports {imem_data[20]}]
set_input_delay -clock clk  800  [get_ports {imem_data[19]}]
set_input_delay -clock clk  800  [get_ports {imem_data[18]}]
set_input_delay -clock clk  800  [get_ports {imem_data[17]}]
set_input_delay -clock clk  800  [get_ports {imem_data[16]}]
set_input_delay -clock clk  800  [get_ports {imem_data[15]}]
set_input_delay -clock clk  800  [get_ports {imem_data[14]}]
set_input_delay -clock clk  800  [get_ports {imem_data[13]}]
set_input_delay -clock clk  800  [get_ports {imem_data[12]}]
set_input_delay -clock clk  800  [get_ports {imem_data[11]}]
set_input_delay -clock clk  800  [get_ports {imem_data[10]}]
set_input_delay -clock clk  800  [get_ports {imem_data[9]}]
set_input_delay -clock clk  800  [get_ports {imem_data[8]}]
set_input_delay -clock clk  800  [get_ports {imem_data[7]}]
set_input_delay -clock clk  800  [get_ports {imem_data[6]}]
set_input_delay -clock clk  800  [get_ports {imem_data[5]}]
set_input_delay -clock clk  800  [get_ports {imem_data[4]}]
set_input_delay -clock clk  800  [get_ports {imem_data[3]}]
set_input_delay -clock clk  800  [get_ports {imem_data[2]}]
set_input_delay -clock clk  800  [get_ports {imem_data[1]}]
set_input_delay -clock clk  800  [get_ports {imem_data[0]}]
set_input_delay -clock clk  800  [get_ports dcache_rvalid]
set_input_delay -clock clk  800  [get_ports dcache_rresp_valid]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[63]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[62]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[61]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[60]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[59]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[58]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[57]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[56]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[55]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[54]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[53]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[52]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[51]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[50]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[49]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[48]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[47]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[46]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[45]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[44]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[43]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[42]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[41]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[40]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[39]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[38]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[37]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[36]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[35]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[34]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[33]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[32]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[31]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[30]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[29]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[28]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[27]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[26]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[25]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[24]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[23]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[22]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[21]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[20]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[19]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[18]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[17]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[16]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[15]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[14]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[13]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[12]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[11]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[10]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[9]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[8]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[7]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[6]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[5]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[4]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[3]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[2]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[1]}]
set_input_delay -clock clk  800  [get_ports {dcache_rdata[0]}]
set_input_delay -clock clk  800  [get_ports dcache_wvalid]
set_input_delay -clock clk  800  [get_ports dcache_wresp_valid]
set_output_delay -clock clk  800  [get_ports imem_read_rdy]
set_output_delay -clock clk  800  [get_ports {imem_addr[63]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[62]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[61]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[60]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[59]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[58]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[57]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[56]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[55]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[54]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[53]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[52]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[51]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[50]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[49]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[48]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[47]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[46]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[45]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[44]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[43]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[42]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[41]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[40]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[39]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[38]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[37]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[36]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[35]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[34]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[33]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[32]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[31]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[30]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[29]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[28]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[27]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[26]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[25]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[24]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[23]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[22]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[21]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[20]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[19]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[18]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[17]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[16]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[15]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[14]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[13]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[12]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[11]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[10]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[9]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[8]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[7]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[6]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[5]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[4]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[3]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[2]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[1]}]
set_output_delay -clock clk  800  [get_ports {imem_addr[0]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[31]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[30]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[29]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[28]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[27]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[26]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[25]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[24]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[23]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[22]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[21]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[20]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[19]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[18]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[17]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[16]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[15]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[14]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[13]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[12]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[11]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[10]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[9]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[8]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[7]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[6]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[5]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[4]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[3]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[2]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[1]}]
set_output_delay -clock clk  800  [get_ports {dcache_raddr[0]}]
set_output_delay -clock clk  800  [get_ports dcache_rready]
set_output_delay -clock clk  800  [get_ports dcache_rresp_ready]
set_output_delay -clock clk  800  [get_ports dcache_write]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[63]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[62]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[61]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[60]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[59]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[58]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[57]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[56]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[55]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[54]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[53]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[52]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[51]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[50]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[49]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[48]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[47]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[46]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[45]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[44]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[43]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[42]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[41]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[40]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[39]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[38]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[37]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[36]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[35]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[34]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[33]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[32]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[31]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[30]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[29]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[28]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[27]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[26]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[25]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[24]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[23]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[22]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[21]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[20]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[19]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[18]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[17]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[16]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[15]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[14]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[13]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[12]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[11]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[10]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[9]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[8]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[7]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[6]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[5]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[4]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[3]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[2]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[1]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_data[0]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[7]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[6]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[5]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[4]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[3]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[2]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[1]}]
set_output_delay -clock clk  800  [get_ports {dcache_wstrb[0]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[31]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[30]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[29]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[28]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[27]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[26]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[25]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[24]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[23]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[22]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[21]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[20]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[19]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[18]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[17]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[16]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[15]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[14]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[13]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[12]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[11]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[10]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[9]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[8]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[7]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[6]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[5]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[4]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[3]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[2]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[1]}]
set_output_delay -clock clk  800  [get_ports {dcache_sw_addr[0]}]
set_output_delay -clock clk  800  [get_ports dcache_wready]
set_output_delay -clock clk  800  [get_ports dcache_wresp_ready]
